#2. В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых. 
# Не учитывать знаки препинания и регистр символов. 
#За основу возьмите любую статью из википедии или из документации к языку.

import re
from collections import Counter

def repeated_10_words(text):
    words = re.findall(r'\b\w+\b', text.lower())
    return Counter(words).most_common(10)

text = """Сильванус Морли был пяти футов семи дюймов (170 см) ростом при весе около 130 фунтов (60 кг) и вполне развитым физически. 
В молодые годы у Морли не было серьёзных проблем со здоровьем, за исключением близорукости, он постоянно носил очки. Ещё одной особенностью, 
которая проявилась в колледже и осталась на всю жизнь, было то, что Сильванус не мог полноценно спать по ночам, но при этом «отключался» 
в любое время суток и в любой ситуации — у родственников, на официальных приёмах и научных мероприятиях. Спорт его совершенно не интересовал, 
однако по совету куратора Патнэма он занимался греблей на каноэ, а гостя на каникулах у тёти ездил верхом, плавал и играл в теннис. 
Он посещал футбольные матчи, воспринимая их как зрелище. 
Морли был модником и тратил большие деньги на одежду и обувь (иногда он не смел признаться в сумме расходов даже себе самому в дневнике)."""
print(repeated_10_words(text))
